tap "databricks/tap"
tap "hashicorp/tap"
tap "jandedobbeleer/oh-my-posh"
tap "microsoft/mssql-release"
tap "nikitabobko/tap"
tap "powershell/tap"
tap "sst/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Automate deployment, configuration, and upgrading
brew "ansible"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin", restart_service: :changed
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Multi-shell multi-command argument completer
brew "carapace"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Kubernetes package manager
brew "helm"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# TOML toolkit written in Rust
brew "taplo"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# Command-line interface for the Databricks platform
brew "databricks/tap/databricks"
# Packer
brew "hashicorp/tap/packer"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql", link: false
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Menu bar weather app
cask "datweatherdoe"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Development environment
cask "hashicorp-vagrant"
# GPU-based terminal emulator
cask "kitty"
# Clipboard manager
cask "maccy"
# Command-line shell and scripting language
cask "powershell"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "docker.docker"
vscode "donjayamanne.kusto"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "wayou.vscode-todo-highlight"
